[
  {
    "id": "1752500988114",
    "userId": "chaarlottesmit@gmail.com",
    "userEmail": "chaarlottesmit@gmail.com",
    "userName": "Charlotte Smit",
    "items": [
      {
        "id": 81,
        "title": "A Clockwork Orange",
        "author": "Anthony Burgess",
        "categoryA": [
          "Classics"
        ],
        "categoryB": [
          "Fiction"
        ],
        "categoryC": [
          "Science Fiction"
        ],
        "image": "https://images.gr-assets.com/books/1348339306l/227463.jpg",
        "description": "A vicious fifteen-year-old \"droog\" is the central character of this 1963 classic, whose stark terror was captured in Stanley Kubrick's magnificent film of the same title.In Anthony Burgess's nightmare vision of the future, where criminals take over after dark, the story is told by the central character, Alex, who talks in a brutal invented slang that brilliantly renders his and his friends' social pathology. A Clockwork Orange is a frightening fable about good and evil, and the meaning of human freedom. When the state undertakes to reform Alex—to \"redeem\" him—the novel asks, \"At what cost?\"This edition includes the controversial last chapter not published in the first edition and Burgess's introduction \"A Clockwork Orange Resucked\".",
        "rating": 3.99,
        "price": 11.99,
        "quantity": 1
      }
    ],
    "totalAmount": 11.99,
    "totalQuantity": 1,
    "status": "completed",
    "createdAt": "2025-07-14T13:49:48.114Z",
    "orderNumber": "ORD-1752500988114"
  },
  {
    "id": "1752501220127",
    "userId": "chaarlottesmit@gmail.com",
    "userEmail": "chaarlottesmit@gmail.com",
    "userName": "Charlotte Smit",
    "items": [
      {
        "id": 201,
        "title": "A Farewell to Arms",
        "author": "Ernest Hemingway",
        "categoryA": [
          "Classics"
        ],
        "categoryB": [
          "Fiction"
        ],
        "categoryC": [
          "Historical"
        ],
        "image": "https://images.gr-assets.com/books/1313714836l/10799.jpg",
        "description": "A Farewell to Arms is the unforgettable story of an American ambulance driver on the Italian front and his passion for a beautiful English nurse. Set against the looming horrors of the battlefield - the weary, demoralized men marching in the rain during the German attack on Caporetto; the profound struggle between loyalty and desertion—this gripping, semiautobiographical work captures the harsh realities of war and the pain of lovers caught in its inexorable sweep. Ernest Hemingway famously said that he rewrote his ending to A Farewell to Arms thirty-nine times to get the words right.",
        "rating": 3.79,
        "price": 13.99,
        "quantity": 1
      }
    ],
    "totalAmount": 13.99,
    "totalQuantity": 1,
    "status": "completed",
    "createdAt": "2025-07-14T13:53:40.127Z",
    "orderNumber": "ORD-1752501220127"
  },
  {
    "id": "1752503457774",
    "userId": "chaarlottesmit@gmail.com",
    "userEmail": "chaarlottesmit@gmail.com",
    "userName": "Charlotte Smit",
    "items": [
      {
        "id": 214,
        "title": "A Confederacy of Dunces",
        "author": "John Kennedy Toole",
        "categoryA": [
          "Fiction"
        ],
        "categoryB": [
          "Classics"
        ],
        "categoryC": [
          "Humor"
        ],
        "image": "https://images.gr-assets.com/books/1436747103l/310612.jpg",
        "description": "Alternate cover for this ISBN can be found here\"A green hunting cap squeezed the top of the fleshy balloon of a head. The green earflaps, full of large ears and uncut hair and the fine bristles that grew in the ears themselves, stuck out on either side like turn signals indicating two directions at once. Full, pursed lips protruded beneath the bushy black moustache and, at their corners, sank into little folds filled with disapproval and potato chip crumbs.\"Meet Ignatius J. Reilly, the hero of John Kennedy Toole's tragicomic tale, A Confederacy of Dunces. This 30-year-old medievalist lives at home with his mother in New Orleans, pens his magnum opus on Big Chief writing pads he keeps hidden under his bed, and relays to anyone who will listen the traumatic experience he once had on a Greyhound Scenicruiser bound for Baton Rouge. (\"Speeding along in that bus was like hurtling into the abyss.\") But Ignatius's quiet life of tyrannizing his mother and writing his endless comparative history screeches to a halt when he is almost arrested by the overeager Patrolman Mancuso--who mistakes him for a vagrant--and then involved in a car accident with his tipsy mother behind the wheel. One thing leads to another, and before he knows it, Ignatius is out pounding the pavement in search of a job.Over the next several hundred pages, our hero stumbles from one adventure to the next. His stint as a hotdog vendor is less than successful, and he soon turns his employers at the Levy Pants Company on their heads. Ignatius's path through the working world is populated by marvelous secondary characters: the stripper Darlene and her talented cockatoo; the septuagenarian secretary Miss Trixie, whose desperate attempts to retire are constantly, comically thwarted; gay blade Dorian Greene; sinister Miss Lee, proprietor of the Night of Joy nightclub; and Myrna Minkoff, the girl Ignatius loves to hate. The many subplots that weave through A Confederacy of Dunces are as complicated as anything you'll find in a Dickens novel, and just as beautifully tied together in the end. But it is Ignatius--selfish, domineering, and deluded, tragic and comic and larger than life--who carries the story. He is a modern-day Quixote beset by giants of the modern age. His fragility cracks the shell of comic bluster, revealing a deep streak of melancholy beneath the antic humor. John Kennedy Toole committed suicide in 1969 and never saw the publication of his novel. Ignatius Reilly is what he left behind, a fitting memorial to a talented and tormented life.",
        "rating": 3.89,
        "price": 9.99,
        "quantity": 1
      }
    ],
    "totalAmount": 9.99,
    "totalQuantity": 1,
    "status": "completed",
    "createdAt": "2025-07-14T14:30:57.774Z",
    "orderNumber": "ORD-1752503457774"
  }
]